export const worksData = [
  {
    category: 'Приложения React',
    data: [
      {
        id: 1,
        link: "https://demjke.github.io/gallery/",
        title: 'Галерея',
        technologies: [1, 7, 12],
        description: 'Интерактивная галерея изображений с поддержкой фильтрации и просмотра в полноэкранном режиме. Реализована с использованием React, Axios для загрузки данных и Tailwind CSS для адаптивного дизайна.',
        img: "/works/gallery.png"
      },
      {
        id: 2,
        link: "https://demjke.github.io/audio-player/",
        title: 'Плеер',
        technologies: [4, 5, 8, 9],
        description: 'Веб-аудиоплеер с функциями воспроизведения, паузы и регулировки громкости. Разработан с использованием HTML, CSS, JavaScript и Sass для стилизации, обеспечивая кроссбраузерную совместимость.',
        img: "/works/player.png"
      },
      {
        id: 3,
        link: "https://demjke.github.io/tik-tak-toe/",
        title: 'Крестики-нолики',
        technologies: [1, 9],
        description: 'Классическая игра "Крестики-нолики" реализована с использованием React и Sass. Поддерживает игру для двух игроков и адаптивный интерфейс для мобильных устройств.',
        img: "/works/tik-tak.png"
      },
      {
        id: 4,
        link: "https://demjke.github.io/calc/",
        title: 'Калькулятор',
        technologies: [1, 9],
        description: 'Функциональный калькулятор для базовых арифметических операций. Построен на React с использованием Sass для стилизации, обеспечивая чистый и отзывчивый интерфейс.',
        img: "/works/calc.png"
      },
      {
        id: 5,
        link: "https://demjke.github.io/appointment/",
        title: 'Приложение встреч',
        technologies: [1, 9, 12],
        description: 'Приложение для планирования встреч с календарем и уведомлениями. Реализована с помощью React, Tailwind CSS и Sass, с акцентом на удобство и современный дизайн.',
        img: "/works/appointment.png"
      },
      {
        id: 6,
        link: "https://demjke.github.io/shop/",
        title: 'Магазин',
        technologies: [1, 2, 3, 7, 8, 13, 14, 15, 16],
        description: 'Интернет-магазин с каталогом товаров, корзиной и фильтрацией. Использует React, Redux, Node.js, Express и MongoDB для серверной части, а также Axios и Material-UI для фронтенда. Обеспечивает высокую производительность и масштабируемость.',
        img: "/works/shop.png"
      },
      {
        id: 7,
        link: "https://demjke.github.io/timer/",
        title: 'Таймер',
        technologies: [1, 9, 13],
        description: 'Приложение-таймер с функциями старта, паузы и сброса. Реализовано на React с использованием Sass и Material-UI, предоставляя минималистичный и удобный интерфейс.',
        img: "/works/timer.png"
      },
      {
        id: 8,
        link: "https://demjke.github.io/todo/",
        title: 'Приложение дел',
        technologies: [1, 9],
        description: 'Приложение для управления списком задач с добавлением и удалением задач. Построено на React с использованием Sass для стилизации, обеспечивая простоту и функциональность.',
        img: "/works/todo.png"
      },
      {
        id: 9,
        link: "https://demjke.github.io/social/",
        title: 'Социальная сеть',
        technologies: [1, 2, 7, 9],
        description: 'Прототип социальной сети с профилями пользователей и публикацией постов. Реализован с использованием React, Redux, Axios и Sass, с акцентом на работу с API и динамическое обновление данных.',
        img: "/works/social.png"
      },
    ]
  },
  {
    category: 'Верстка под CMS',
    data: [
      {
        id: 1,
        link: "https://www.sklad-oborudovanye.ru/",
        title: '#01',
        img: "/works/1.png",
        description: "Интернет-магазин складского оборудования с интуитивно понятным интерфейсом. Включает каталог с фильтрами, карточки товаров и форму заказа. Сайт оптимизирован для SEO и быстрой загрузки на всех устройствах."
      },
      {
        id: 2,
        link: "https://www.ask-polimer.ru/",
        title: '#02',
        img: "/works/2.png",
        description: "Сайт для компании, производящей полимерные материалы. Предоставляет подробную информацию о продукции, услугах и технологиях. Реализован современный дизайн с акцентом на визуальное представление производства."
      },
      {
        id: 3,
        link: "https://www.s-logika.ru/",
        title: '#03',
        img: "/works/3.png",
        description: "Веб-ресурс для компании, предоставляющей логистические решения. Содержит информацию об услугах, кейсах и контактах. Разработан с учетом UX/UI для удобства пользователей и высокой производительности."
      },
      {
        id: 4,
        link: "https://www.realmi-ural.ru/",
        title: '#04',
        img: "/works/4.png",
        description: "Корпоративный сайт для компании в сфере недвижимости. Включает каталог объектов, интерактивную карту и форму обратной связи. Адаптивный дизайн обеспечивает комфортное использование на мобильных устройствах."
      },
      {
        id: 5,
        link: "https://www.metalloprokat174.ru/",
        title: '#05',
        img: "/works/5.png",
        description: "Сайт для поставщика металлопроката с подробным каталогом продукции и возможностью заказа онлайн. Оптимизирован для SEO, что повышает видимость в поисковых системах."
      },
      {
        id: 6,
        link: "https://www.hightech-instrument.ru/",
        title: '#06',
        img: "/works/6.png",
        description: "Веб-платформа для компании, поставляющей высокотехнологичные инструменты. Реализован современный дизайн с акцентом на технические характеристики продукции и удобство заказа."
      },
      {
        id: 7,
        link: "https://www.yasenpen96.ru/",
        title: '#07',
        img: "/works/7.png",
        description: "Сайт для производителя пенополистирола. Содержит информацию о продукции, сертификаты и форму для заявок. Адаптивный интерфейс обеспечивает доступность на всех устройствах."
      },
      {
        id: 8,
        link: "https://www.parnas-perm.ru/",
        title: '#8',
        img: "/works/8.png",
        description: "Сайт для бизнес-центра в Перми. Представляет информацию об аренде помещений, инфраструктуре и контактах. Реализован минималистичный дизайн с удобной навигацией."
      },
      {
        id: 9,
        link: "https://www.xn--80aeojewbbatkm3l.xn--p1ai/",
        title: '#9',
        img: "/works/9.png",
        description: "Веб-ресурс для строительной компании, предлагающей услуги в регионах. Содержит портфолио проектов, описание услуг и форму обратной связи. Оптимизирован для мобильных устройств."
      },
      {
        id: 10,
        link: "https://www.splavm-66.ru/",
        title: '#10',
        img: "/works/10.png",
        description: "Сайт для компании, занимающейся поставками сплавов и металлических изделий. Включает каталог с фильтрацией, описание продукции и форму заказа. Обеспечивает быструю загрузку и SEO-оптимизацию."
      },
      {
        id: 11,
        link: "https://www.xn--80aakabxcskt8hzd.xn--p1ai/",
        title: '#11',
        img: "/works/11.png",
        description: "Веб-платформа для компании, предоставлению услуг в сфере оборудования. Содержит информацию о продукции, технические данные и контакты. Разработан с учетом UX для повышения конверсии."
      },
    ]
  },

];